<a href="https://colab.research.google.com/github/ishancoderr/Rainfall_predictor/blob/main/Make_csv_file_for_make_ML_model.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://www.scirp.org/journal/paperinformation.aspx?paperid=81276


https://en.climate-data.org/asia/sri-lanka/uva/badulla-764256/

https://books.google.lk/books?id=L3ckDwAAQBAJ&pg=PA270&lpg=PA270&dq=rainfall+data+with+cumulative+time+in+badulla&source=bl&ots=3YCsce_9-A&sig=ACfU3U1hUHgX5JoFKeC2LIYimb4GFj_CsA&hl=en&sa=X&ved=2ahUKEwjyy9av1aHzAhVBjeYKHXS_DAkQ6AF6BAglEAM#v=onepage&q=rainfall%20data%20with%20cumulative%20time%20in%20badulla&f=false

**Importing the libraries**

In [40]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

**Importing Rainfall data**

In [42]:

import io
import requests
url='https://raw.githubusercontent.com/ishancoderr/Rainfall_predictor/main/Rainfall.csv'
s=requests.get(url).content
dataset=pd.read_csv(io.StringIO(s.decode('utf-8')))

In [43]:
dataset.head()

   Year     Month  Day  ...  Duration (hr)  Avg_intensity (mm/hr)  occur
0  1997  November   17  ...            6.0                     43    yes
1  1997  November   19  ...            5.0                     53    yes
2  1997  November   19  ...            6.0                     48    yes
3  1997  November   19  ...            4.0                     54    yes
4  1998  November   16  ...            3.0                     50    yes

[5 rows x 7 columns]

In [44]:
column_names=dataset.columns.values.tolist()
print(column_names)

['Year', 'Month', 'Day', 'Avg_Accumulation (mm)', 'Duration (hr)', 'Avg_intensity (mm/hr)', 'occur']

**import Encoders**

In [45]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder

In [46]:
labelencode=LabelEncoder()
dataset['occur_']=labelencode.fit_transform(dataset['occur'])
labelencode=LabelEncoder()
dataset['Month_']=labelencode.fit_transform(dataset['Month'])
labelencode=LabelEncoder()

In [47]:
dataset.head()

   Year     Month  Day  ...  occur  occur_  Month_
0  1997  November   17  ...    yes       1       9
1  1997  November   19  ...    yes       1       9
2  1997  November   19  ...    yes       1       9
3  1997  November   19  ...    yes       1       9
4  1998  November   16  ...    yes       1       9

[5 rows x 9 columns]

**Make new data frame with this dataset**

In [48]:
new_dataset= dataset[[ 'Avg_Accumulation (mm)', 'Duration (hr)', 'Avg_intensity (mm/hr)', 'occur_']]

In [49]:
new_dataset.head()

   Avg_Accumulation (mm)  Duration (hr)  Avg_intensity (mm/hr)  occur_
0                    257            6.0                     43       1
1                    268            5.0                     53       1
2                    289            6.0                     48       1
3                    215            4.0                     54       1
4                    149            3.0                     50       1

In [50]:
new_dataset.to_csv('rainfall_data.csv')